Revit 2020 API
ElectricalEquipment.DistributionSystem Property
get or set the Distribution System for the Electrical Equipment.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Syntax
C#
public DistributionSysType DistributionSystem { get; set; }
Visual Basic
Public Property DistributionSystem As DistributionSysType
	Get
	Set
Visual C++
public:
property DistributionSysType^ DistributionSystem {
	DistributionSysType^ get ();
	void set (DistributionSysType^ value);
}
Remarks
This property returns a Distribution System which is assigned to the Electrical Equipment. If there are no Distribution System assigned to this Electrical Equipment, this property will be null.
See Also
ElectricalEquipment Class
Autodesk.Revit.DB.Electrical Namespace